// +----------------------------------------------------------------------
// | Code.Cap [ All samples in it! ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016 All rights reserved.
// +----------------------------------------------------------------------
// | Author: canaddy <canaddy_2007@126.com> <https://github.com/canaddy/electron>
// +----------------------------------------------------------------------
//-----------------------
// 变量定义 - 全局
// ----------------------












//-----------------------
// 主函数 - 程序入口
// ----------------------
/**
 * 入口函数
 * @return 
 * @author canaddy <canaddy_2007@126.com>
 */
function main() {
	// 添加文档树加载事件监听完成之后执行fucntion 
    // document.addEventListener("DOMContentLoaded", function (event) {
    //     var uiHandler = new UIHandler()
    // })
}










//-----------------------
// 入口函数
// ----------------------
if (true) {
	main()
};